<template>
  <div class="privacy_view">
    <main class="single_column">
      <header>
        <h1>
          プライバシーポリシー
        </h1>
      </header>
      <div id="content">
        <p>当ブログ執筆者 みるみ は、下記プライバシーポリシーに則りサイト運営を致します。</p>
        <h3>このブログについて</h3>
        <p>このブログの URL ドメインは mirumi.tech です。また、通信は SSL/TLS によってセキュアな接続で保護されており、当ブログへのアクセス、書き込み等によって第三者に情報が漏洩することはありません。</p>
        <h3>このサイトが収集する個人データと収集の理由</h3>
        <h4>コメント</h4>
        <p>現在は実装されていませんが将来的にコメント機能が実装された場合において、スパム検出に役立てるため IP アドレスやブラウザーユーザーエージェント文字列を収集することがあります。これらの情報から特定のユーザーを限定することはできません。</p>
        <p>ブログにコメントを残す際、お名前、メールアドレス、サイト URL などを Cookie に保存することがあります。これはユーザーの利便性のためであり、いつかまた他のコメントを残す際に詳細情報を再入力する手間を省きます。この Cookie は 1 年間保持されます。</p>
        <h4>お問い合わせ</h4>
        <p>当サイトにはお問い合わせの専用フォームというものは存在していません。そのかわりメールによる連絡手段を提供しており、サイト内で開示している運営者のメールアドレスに対してお好きなメールクライアントからご連絡が可能です。</p>
        <p>送信いただく情報は必要最低限の目的にしか使用されず、メールアドレスなど特に個人に紐づく情報を許可なく提示、共有、拡散などすることはありません。しかし秘密保持契約 (NDA) を締結しているわけではないことには十分ご留意ください。</p>
        <h4>他サイトからの埋め込みコンテンツ</h4>
        <p>このブログの投稿には埋め込みコンテンツ (動画、画像、投稿など) が含まれます。他サイトからの埋め込みコンテンツは、訪問者がそのサイトを訪れた場合とまったく同じように振る舞います。</p>
        <p>これらのサイトは、ユーザーのデータの収集、Cookie の使用、サードパーティによる追加トラッキングの埋め込み、埋め込みコンテンツとのやりとりの監視を行うことがあります。アカウントを使ってそのサイトにログイン中の場合、埋め込みコンテンツとのやりとりのトラッキングも含まれます。</p>
        <h4>アナリティクス</h4>
        <p>このブログのアクセス解析ツールとして、<a href="https://analytics.google.com/">Google Analytics</a> を使用しています。データの収集には Cookie やブラウザーユーザーエージェント文字列も利用され、それらの情報をもとにアクセス数、アクセスしている端末の種類、国、閲覧時間等がサイト管理者に通知されます。また、<a href="https://youradchoices.com">YourAdChoices</a> にアクセスすると、パーソナライズド広告に使われる第三者配信事業者の Cookie を無効にすることが可能です。</p>
        <h4>広告</h4>
        <p>当ブログは、以下のような広告を掲載しています。これらの掲載に、上述した各種情報が利用されることがあります。</p>
        <h5>Google AdSense</h5>
        <p>このブログに存在する広告主（Google を含む各広告主）は、同じく Cookie を利用して掲載する広告を決定しています。ときにはログイン中の他社のサービスアカウントに紐づく情報がパーソナライズに使用されることもあるでしょう。</p>
        <h5>免責事項</h5>
        <p>当ブログからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。</p>
        <h3>ユーザーのデータの送信先</h3>
        <p>訪問者によるコメントは、自動スパム検出サービスを通じて確認を行う場合があります。</p>
        <h3>著作権</h3>
        <p>当ブログに存在する、文章・画像・動画等の著作物においての全ての情報を無断転載することを禁止します。</p>
        <p>記述等を自サイトで掲載する場合は &lt;blockquote&gt; タグで引用であることを示し、該当ページへのリンクを行うようにしてください。</p>
        <h3>各種素材についての免責事項</h3>
        <p>当ブログで掲載している画像や動画の著作権・肖像権等は各権利所有者に帰属します。</p>
        <p>当ブログの運営者がオリジナルで作成したものはこの限りではありません（前述の「著作権」の項が適用）。</p>
        <p style="margin: 3em 0.7em auto auto; text-align: right; font-size: 0.9em;">mirumi.tech: {{ SITE_CREATED_AT }} 制定</p>
      </div>
      <footer>
        <!-- (｡･ڡ･｡) -->
      </footer>
    </main>
  </div>
</template>

<script setup lang="ts">
import { SITE_FULL_PATH, SITE_CREATED_AT } from "@/utils/defines"

const router = useRouter()

useSetMeta({
  title: "プライバシーポリシー",
  description: "mirumi.tech のプライバシーポリシーです。",
  keywords: "みるめも,みるみ,blog,technology,programming,privacy,policy",
  url: SITE_FULL_PATH + "/" + router.currentRoute.value.path,
  createdAt: SITE_CREATED_AT,
  updatedAt: SITE_CREATED_AT,  // changed!
})
</script>

<style lang="scss" scoped>
</style>
